#1
nums = [1, 2, 3, 4, 5, 6]
res = nums[::-1]
print(res)
# #ამ კოდში შევქმენით სია. 2 ხაზზე დავწერეთ კოდი სადაც ათვლა იწყება 
# # საპირისპირო მხრიდან და საბოლოოდ დავპრინტეთ

#2
str = input()
print(str[-1])
#ჯერ ჩვენ შევქმენით ცვლადი input-ი და შემდგომში კოდი რომელიც ჩვენს მიერ ჩაწერილ რიცხვებდგამოიტანს

#3
სახელები = ['ანდრია', 'ბექა', 'გიორგი', 'დავით', 'ზუკა']
შედეგი = სახელები[1:-1]
print("საწყისი სია:", სახელები)
print("ნაჭერი სია (სახელები[1:-1]):", შედეგი)
print("ელემენტების რაოდენობა:", (შედეგი))

#ჯერ ჩვენ შევქმენით სია და შემდგომში დავწერეთ კოდი სადაც ათვლა პირიქით იწყება

#4
list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
print(list[4:-1])
#ჯერ შევქმენით სია შემდგომში დავპრინტეთ ბოლო 5 რიცხვი

#5
text = input()
print(text[::-1])
#ჯერ ჩვენ შევქმენით ცვლადი input-ი და შემდგომში ჩვენს მიერ ჩაწერილი სიტყვა პირიქით დაიწერება